// Проверяет что переданные адреса включены в задачу,
// Параметры:
//  Адреса - Строка - содержит электронные адреса
//  Задача - ЗадачаСсылка.ЗадачаИсполнителя
Процедура Метод(Адреса) Экспорт
	// 1
КонецПроцедуры

// 2. Проверяет что переданные адреса включены в задачу
// Параметры:
//  Адреса - Строка - содержит электронные адреса
Процедура Метод(Адреса, Задача) Экспорт
	// 2
КонецПроцедуры

// 3. Проверяет что переданные адреса включены в задачу
// Параметры:
Процедура Метод(Адреса) Экспорт
	// 3
КонецПроцедуры

// 4. Проверяет что переданные адреса включены в задачу
Процедура Метод(Адреса) Экспорт
	// 3
КонецПроцедуры

Процедура Метод(Адреса) Экспорт
	// 4
КонецПроцедуры

// Проверяет что переданные адреса включены в задачу
// Параметры:
//  Адреса - Строка - содержит электронные адреса
Процедура Метод(Адреса) Экспорт
// 5
КонецПроцедуры

//  Процедура удаляет элементы одной коллекции из другой если коллекции одинаковых типов
// Параметры:
//  Приемник - Массив ФиксированныйМассив СписокЗначений Структура ФиксированнаяСтруктура Соответствие ФиксированноеСоответствие ТаблицаЗначений - Уменьшаемая коллекция
//  Источник - Массив ФиксированныйМассив СписокЗначений Структура ФиксированнаяСтруктура Соответствие ФиксированноеСоответствие ТаблицаЗначений - Вычитаемая коллекция
//
Процедура ВычестьУниверсальнуюКоллекцию(Приемник, Источник) Экспорт

КонецПроцедуры	
